Created by Donald E. Brown on 2016-09-12.
Copyright (c) 2016 Donald E. Brown. All rights reserved.

# Install packages using anaconda package manager

conda install matplotlib

In [1]:
# Data
import pandas as pd
import numpy as np
import scipy as sp

# Plotting
import matplotlib as mpl
import matplotlib.pyplot as plt


# Printing

%matplotlib inline

# Pandas Review

A short review of the elements of Pandas

Pandas provides
* Data handling
* Capabilities for data wrangling
* Data structures for analysis


### Series

An array of values and an associated array of labels or index

In [2]:
# Example with a default index

myseries = pd.Series([1,2,3,4])
myseries

0    1
1    2
2    3
3    4
dtype: int64

In [3]:
myseries.values

array([1, 2, 3, 4])

In [4]:
myseries.index

RangeIndex(start=0, stop=4, step=1)

In [5]:
myseries = pd.Series([1,2,3,4], index = ['a','b','c','d'])
myseries

a    1
b    2
c    3
d    4
dtype: int64

In [6]:
# indexing series & scalar multiplication
myseries[['a', 'b']]*5

a     5
b    10
dtype: int64

In [7]:
myseries2 = pd.Series(range(5), ['a','b','c','d', 'e'])
myseries2

a    0
b    1
c    2
d    3
e    4
dtype: int64

In [8]:
# Can do vector additions, boolean selection .... with series

myseries + myseries2

a    1.0
b    3.0
c    5.0
d    7.0
e    NaN
dtype: float64

In [9]:
# Slicing

myseries2[myseries2 > 1]

c    2
d    3
e    4
dtype: int64

In [10]:
# Can get elements of the series with the indices

myseries2[['d', 'b', 'e']]

d    3
b    1
e    4
dtype: int64

In [11]:
# A series can be considered a fixed-length, ordered dict
# so it can use functions on dict
# E.G.,

'e' in myseries2

True

In [12]:
# Can create a series from a dict

cars = {'Lexus': 55000, 'Honda': 32000, 'Toyota': 31000, 'Chevy': 28000, 'KIA': 26000}
myseries3 = pd.Series(cars)
myseries3

Chevy     28000
Honda     32000
KIA       26000
Lexus     55000
Toyota    31000
dtype: int64

In [13]:
# A dict will convert the dict keys to the series index

cartypes = ['Ford', 'Chevy', 'Honda', 'Toyota']

myseries4 = pd.Series(cars, index = cartypes)

myseries4

Ford          NaN
Chevy     28000.0
Honda     32000.0
Toyota    31000.0
dtype: float64

In [14]:
# isnull and notnull functions

pd.isnull(myseries4)

Ford       True
Chevy     False
Honda     False
Toyota    False
dtype: bool

In [15]:
pd.notnull(myseries4)

Ford      False
Chevy      True
Honda      True
Toyota     True
dtype: bool

In [17]:
# instance method

myseries4.isnull()
myseries4

Ford          NaN
Chevy     28000.0
Honda     32000.0
Toyota    31000.0
dtype: float64

In [19]:
myseries3

Chevy     28000
Honda     32000
KIA       26000
Lexus     55000
Toyota    31000
dtype: int64

In [18]:
# Auto alignment in arithmetic operation
# Notice which comes first

myseries3 + myseries4

Chevy     56000.0
Ford          NaN
Honda     64000.0
KIA           NaN
Lexus         NaN
Toyota    62000.0
dtype: float64

In [20]:
# The series and the index can have attribute names

myseries4.name = 'CarCosts'
myseries4.index.name = 'CarNames'
myseries4

CarNames
Ford          NaN
Chevy     28000.0
Honda     32000.0
Toyota    31000.0
Name: CarCosts, dtype: float64

In [21]:
myseries4.index.name

'CarNames'

### Dataframes

* Like dataframe in R
* 2D but there are higher order extensions

In [26]:
# Data Frames
# Example creating a DF using dict

data = {'atom':['H','He','Li'],'num':[1,2,3],'mass':[1.0,4.0,6.9]}
df1 = pd.DataFrame(data)
df1

  atom  mass  num
0    H   1.0    1
1   He   4.0    2
2   Li   6.9    3

In [27]:
# Select columns, add a new column and change the index

df2 = pd.DataFrame(data,columns=['atom','num','c'],index = ['a', 'b', 'c'])

df2

  atom  num    c
a    H    1  NaN
b   He    2  NaN
c   Li    3  NaN

In [28]:
# Creating an empty DF with just an index of the original column names

df3 = pd.DataFrame(data,columns=['a','b','c'],index = ['atom', 'num', 'mass'])

df3

        a    b    c
atom  NaN  NaN  NaN
num   NaN  NaN  NaN
mass  NaN  NaN  NaN

In [29]:
# Retrieving  columns

df1[['atom', 'num']]

  atom  num
0    H    1
1   He    2
2   Li    3

In [30]:
# Column attribute

df1.atom

0     H
1    He
2    Li
Name: atom, dtype: object

In [31]:
# Column names

df1.columns

Index(['atom', 'mass', 'num'], dtype='object')

In [32]:
# Retrieving rows
# ix

df2.ix['c']

atom     Li
num       3
c       NaN
Name: c, dtype: object

In [33]:
# row order

df2.ix[2]

atom     Li
num       3
c       NaN
Name: c, dtype: object

In [34]:
# loc

df2.loc['c']

atom     Li
num       3
c       NaN
Name: c, dtype: object

In [35]:
# iloc

df2.iloc[2]

atom     Li
num       3
c       NaN
Name: c, dtype: object

In [36]:
# Adding columns

df2["color"]= ['r', 'g', 'b']
df2

# note: you cannot use df2.color

  atom  num    c color
a    H    1  NaN     r
b   He    2  NaN     g
c   Li    3  NaN     b

In [39]:
# Changing values in a column

df2['c'] = [33,22,11]

df2

  atom  num   c color
a    H    1  33     r
b   He    2  22     g
c   Li    3  11     b

In [47]:
# Deleting rows

df2.drop('b', 0)

  atom  num   c color
a    H    1  33     r
c   Li    3  11     b

In [48]:
# Deleting a column

df2.drop('color',1)

  atom  num   c
a    H    1  33
b   He    2  22
c   Li    3  11

In [49]:
# Delete a column without reassigning

df2.drop('c', 1, inplace = True)

df2

  atom  num color
a    H    1     r
b   He    2     g
c   Li    3     b

In [50]:
# nested dict to create a data frame

schools = {'UCF': {2012:60048 ,2013: 59770, 2015: 63016}, 'OSU':{2012:57466 , 2013: 63964, 2015: 55508}, 
       'TxAM':{2012: 58804, 2013:52449, 2015: 58515}, "UVA":{2013: 21238}}
schools

{'OSU': {2012: 57466, 2013: 63964, 2015: 55508},
 'TxAM': {2012: 58804, 2013: 52449, 2015: 58515},
 'UCF': {2012: 60048, 2013: 59770, 2015: 63016},
 'UVA': {2013: 21238}}

In [51]:
# This nested dict becomes a data frame with column names for the outer keys
# and index for the inner keys

df4 = pd.DataFrame(schools)
df4

        OSU   TxAM    UCF      UVA
2012  57466  58804  60048      NaN
2013  63964  52449  59770  21238.0
2015  55508  58515  63016      NaN

In [52]:
# Dicts of series
# See Table 5.1 for more

pd.DataFrame({'Atom': df1['atom'], 'Color':df2['color']})

  Atom Color
0    H   NaN
1   He   NaN
2   Li   NaN
a  NaN     r
b  NaN     g
c  NaN     b

In [53]:
# index names

df4.index.name = 'Year'

df4.index.name

'Year'

In [55]:
# Column names

df4.columns.name= 'State'


df4.columns.name
df4

State    OSU   TxAM    UCF      UVA
Year
2012   57466  58804  60048      NaN
2013   63964  52449  59770  21238.0
2015   55508  58515  63016      NaN

In [ ]:
# The data frame array of values
# Notice that the columns are of different types

df2.values

### Exercise 1

Create a 5X5 data frame whose entries are random draws from a uniform (0,1) and with column labels that are the names of five countries and row labels, [a, b, c, d, e]. Call the data frame 'Countries'.

In [61]:
uniform(0,1)

0.22621281740285926

In [114]:
from random import uniform
x1=[uniform(0,1) for p in range(0,5)]
x2=[uniform(0,1) for p in range(0,5)]
x3=[uniform(0,1) for p in range(0,5)]
x4=[uniform(0,1) for p in range(0,5)]
x5=[uniform(0,1) for p in range(0,5)]
ex = {'USA': x1, 'MEXICO':x2, 
       'CANADA':x3, 'CUBA':x4,'COSTA RICA':x5}
countries = pd.DataFrame(ex)

## Index Objects

In [65]:
# Indices and columns are immutable 

df2.index

Index(['a', 'b', 'c'], dtype='object')

In [66]:
# Try changing

df2.index = 'z'

TypeError: Index(...) must be called with a collection of some kind, 'z' was passed

In [67]:
# Immutability allows for sharing among data structures

index = df4.index

index

Int64Index([2012, 2013, 2015], dtype='int64', name='Year')

In [68]:
# Note sharing of index names

s5 = pd.Series(range(3), index = index)

s5

Year
2012    0
2013    1
2015    2
dtype: int64

In [69]:
# Can run set operations

'UVA' in df4.columns

True

In [70]:
# row indices

2014 in df4.index

False

### Reindexing

Create a new object with data using a given index

In [71]:
# use reindex() to create a new object
# with different indices and columns

# Create a series

ser = pd.Series(np.arange(5))
ser

0    0
1    1
2    2
3    3
4    4
dtype: int64

In [75]:
# Create a new series from ser with a different index

ser2= ser.reindex([3,15,2,11,1])
ser2

3     3.0
15    NaN
2     2.0
11    NaN
1     1.0
dtype: float64

In [76]:
# pandas has methods for filling missing values
# For example, filling with fixed value
ser2= ser.reindex([4, 10,2,11,1], fill_value = 111)
ser2

4       4
10    111
2       2
11    111
1       1
dtype: int64

In [77]:
# Filling missing values with the previous value

ser2= ser.reindex([0,2,3])
ser3 = ser2.reindex(np.arange(5), method = 'ffill')
ser3

0    0
1    0
2    2
3    3
4    3
dtype: int64

In [78]:
# Reindexiing data frames

# Start with a data frame

df3 = pd.DataFrame(np.arange(9).reshape(3,3), index = ['a','c','d'], columns = ['Ohio', 'Texas','California'])
df3

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [79]:
# Changing the index and add a new row

df4 = df3.reindex(['a','b','c','d'])
df4

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [80]:
# Add values to the row

df4.ix['b'] = [9,10,11]
df4

   Ohio  Texas  California
a   0.0    1.0         2.0
b   9.0   10.0        11.0
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [81]:
# reindexing columns and adding a new column

states = ['Virginia', 'Texas','California']
df5 = df3.reindex(columns = states)
df5

   Virginia  Texas  California
a       NaN      1           2
c       NaN      4           5
d       NaN      7           8

In [82]:
# Adding values to the column

df5['Virginia'] = [9,10,11]
df5

   Virginia  Texas  California
a         9      1           2
c        10      4           5
d        11      7           8

In [83]:
# reindexing both rows and columns
# notice that filling forward only applies row-wise

df6 = df3.reindex(index = ['a','b','c','d'], columns = states, method = 'ffill')
df6

   Virginia  Texas  California
a       NaN      1           2
b       NaN      1           2
c       NaN      4           5
d       NaN      7           8

In [84]:
# using ix

df6 = df3.ix[['a','b','c','d'],states]
df6

   Virginia  Texas  California
a       NaN    1.0         2.0
b       NaN    NaN         NaN
c       NaN    4.0         5.0
d       NaN    7.0         8.0

### Dropping Entries

In [85]:
# Dropping entries from a series

ser1 = pd.Series(np.arange(5), index = ['a','b','c','d','e'])
ser1

a    0
b    1
c    2
d    3
e    4
dtype: int64

In [86]:
# Drop 'c'

ser2 = ser1.drop('c')
ser2

a    0
b    1
d    3
e    4
dtype: int64

In [87]:
# Dropping from data frames, you choose the axis

states = ['Virginia', 'Texas','California', 'New York']
df7 = pd.DataFrame(np.arange(16).reshape(4,4), 
                   index = states, 
                   columns = ['X1', 'X2', 'X3', 'X4'])
df7

            X1  X2  X3  X4
Virginia     0   1   2   3
Texas        4   5   6   7
California   8   9  10  11
New York    12  13  14  15

In [88]:
# Dropping rows

df7.drop(['Texas', 'New York'])

            X1  X2  X3  X4
Virginia     0   1   2   3
California   8   9  10  11

In [92]:
# Dropping columns

df7.drop(['X2','X3'], 1)

            X1  X4
Virginia     0   3
Texas        4   7
California   8  11
New York    12  15

### Indexing, selection, and filtering

In [93]:
# Indexing a series is like numpy but with an index

ser1 = pd.Series(np.arange(5), index = ['a','b','c','d','e'])
ser1

a    0
b    1
c    2
d    3
e    4
dtype: int64

In [94]:
ser1[1]

1

In [95]:
ser1['a']

0

In [96]:
ser1[1:3]

b    1
c    2
dtype: int64

In [100]:
ser1[['b','c']]

b    1
c    2
dtype: int64

In [101]:
# slicing with labels
# Notice that it includes the end point

ser1['b':'d']

b    1
c    2
d    3
dtype: int64

In [102]:
# For data frames

states = ['Virginia', 'Texas','California', 'New York']
df7 = pd.DataFrame(np.arange(16).reshape(4,4), 
                   index = states, 
                   columns = ['X1', 'X2', 'X3', 'X4'])
df7

            X1  X2  X3  X4
Virginia     0   1   2   3
Texas        4   5   6   7
California   8   9  10  11
New York    12  13  14  15

In [103]:
# Slicing by rows

df7['Texas':'California']

            X1  X2  X3  X4
Texas        4   5   6   7
California   8   9  10  11

In [104]:
# Selecting columns

df7[['X1','X3']]

            X1  X3
Virginia     0   2
Texas        4   6
California   8  10
New York    12  14

In [108]:
# Boolean indexing

df7 > 5

               X1     X2     X3     X4
Virginia    False  False  False  False
Texas       False  False   True   True
California   True   True   True   True
New York     True   True   True   True

In [106]:
# Boolean indexed values

df7[df7 > 5]

              X1    X2    X3    X4
Virginia     NaN   NaN   NaN   NaN
Texas        NaN   NaN   6.0   7.0
California   8.0   9.0  10.0  11.0
New York    12.0  13.0  14.0  15.0

In [111]:
# Using ix for indexing

df7.ix[2:3, 1:3]

            X2  X3
California   9  10

In [112]:
df7.ix[['Virginia', 'California'], ['X1', 'X3']]

            X1  X3
Virginia     0   2
California   8  10

## Excerise 2

Add a new country to the data frame Countries. Populate the cells will values from U[0,1]. 

Replace all cells with values less than or equal to 0.3 with 0

In [133]:

count = ['CANADA', 'COSTA RICA', 'CUBA', 'USA','CHINA']
countries2 = countries.reindex(columns = count)
countries2['CHINA'] = [uniform(0,1) for p in range(0,5)]
countries2
countries2=countries2[countries2 <= .3]
pd.DataFrame.fillna(countries2, 0)

   CANADA  COSTA RICA      CUBA       USA     CHINA
0     0.0    0.000000  0.000000  0.000000  0.000000
1     0.0    0.134768  0.000000  0.000000  0.000000
2     0.0    0.000000  0.221390  0.295904  0.000000
3     0.0    0.000000  0.140902  0.000000  0.000000
4     0.0    0.000000  0.000000  0.000000  0.288089

## Object Arithmatic

In [134]:
# Math between series and data frames

states = ['Virginia', 'Texas','California', 'New York']
df7 = pd.DataFrame(np.arange(16).reshape(4,4), 
                   index = states, 
                   columns = ['X1', 'X2', 'X3', 'X4'])


df7

            X1  X2  X3  X4
Virginia     0   1   2   3
Texas        4   5   6   7
California   8   9  10  11
New York    12  13  14  15

In [141]:
# Subtraction


aseries = df7.ix[0]

df7 - aseries

            X1  X2  X3  X4
Virginia     0   0   0   0
Texas        4   4   4   4
California   8   8   8   8
New York    12  12  12  12

In [142]:
# Functions applied to data frames
states = ['Virginia', 'Texas','California', 'New York']
states.append('Oregon')
df8 = pd.DataFrame(np.random.randn(5,3), index = states, columns = list('bde') )
df8.abs()

                   b         d         e
Virginia    1.311452  0.707963  0.437598
Texas       1.421182  0.088271  0.461698
California  0.489867  0.924246  0.371672
New York    1.841962  0.024588  0.362619
Oregon      0.334531  1.761859  1.437012

In [143]:
# applying a function to each row or column 

afunction = lambda x: x.max()-x.min()

print(df8.apply(afunction))
print(df8.apply(afunction, axis = 1))

b    3.153414
d    2.686105
e    1.898710
dtype: float64
Virginia      2.019414
Texas         1.332911
California    1.414113
New York      2.204581
Oregon        1.427328
dtype: float64

In [144]:
# Element-wise function application
# with applymap

format = lambda x: '%.2f' % x
df3.applymap(format)

   Ohio Texas California
a  0.00  1.00       2.00
c  3.00  4.00       5.00
d  6.00  7.00       8.00

In [145]:
# Sorting and ranking

aseries = pd.Series(range(4), index = ['b', 'd', 'a', 'c'])
print(aseries)
print(aseries.sort_index())

b    0
d    1
a    2
c    3
dtype: int64
a    2
b    0
c    3
d    1
dtype: int64

In [146]:
# Sorting a data frame

df3 = pd.DataFrame(np.arange(8).reshape(2,4), index = ['Three', 'One'], columns =['b', 'd', 'a', 'c'])
print(df3)
print(df3.sort_index())
print(df3.sort_index(axis =1))
print(df3.sort_index(axis = 1, ascending = False))

       b  d  a  c
Three  0  1  2  3
One    4  5  6  7
       b  d  a  c
One    4  5  6  7
Three  0  1  2  3
       a  b  c  d
Three  2  0  3  1
One    6  4  7  5
       d  c  b  a
Three  1  3  0  2
One    5  7  4  6

In [148]:
df3 = pd.DataFrame({'b':[4,7,-3,2], 'a':[0,1,0,1]})
print(df3)
print(df3.sort_values(by='b'))
print(df3.sort_values(by=['a','b']))
print(df3.sort_values(by=['b','a']))

   a  b
0  0  4
1  1  7
2  0 -3
3  1  2
   a  b
2  0 -3
3  1  2
0  0  4
1  1  7
   a  b
2  0 -3
0  0  4
3  1  2
1  1  7
   a  b
2  0 -3
3  1  2
0  0  4
1  1  7

In [149]:
# Ranking

df3['c'] = [8,-2,0,4]
print(df3)
print(df3.rank(axis = 1)) # By row

   a  b  c
0  0  4  8
1  1  7 -2
2  0 -3  0
3  1  2  4
     a    b    c
0  1.0  2.0  3.0
1  2.0  3.0  1.0
2  2.5  1.0  2.5
3  1.0  2.0  3.0

In [150]:
# Missing data
# Fill na

df3 = pd.DataFrame({'b':[4,7,np.nan,2], 'a':[np.nan,1,0,1], 'c':[8,1,-2,3]})
print(df3)
print(df3.fillna(0))
print(df3.fillna({'b':0, 'a':-1}))

     a    b  c
0  NaN  4.0  8
1  1.0  7.0  1
2  0.0  NaN -2
3  1.0  2.0  3
     a    b  c
0  0.0  4.0  8
1  1.0  7.0  1
2  0.0  0.0 -2
3  1.0  2.0  3
     a    b  c
0 -1.0  4.0  8
1  1.0  7.0  1
2  0.0  0.0 -2
3  1.0  2.0  3

In [152]:
# Drop NA
print(df3)
print(df3.dropna()) # Drops rows
print(df3.dropna(axis = 1)) # Drops columns

     a    b  c
0  NaN  4.0  8
1  1.0  7.0  1
2  0.0  NaN -2
3  1.0  2.0  3
     a    b  c
1  1.0  7.0  1
3  1.0  2.0  3
   c
0  8
1  1
2 -2
3  3

In [153]:
# Logical fill

print(df3.isnull())
print(df3.notnull())

       a      b      c
0   True  False  False
1  False  False  False
2  False   True  False
3  False  False  False
       a      b     c
0  False   True  True
1   True   True  True
2   True  False  True
3   True   True  True

In [154]:
# Hierarchical Indexing

aseries=pd.Series(np.random.randn(5),index=[['a','a','b','b','c'],[1,3,5,2,4]])
print(aseries)

a  1    0.300150
   3   -0.852024
b  5    0.861731
   2   -1.119424
c  4   -1.105367
dtype: float64

In [155]:
print(aseries.index)

MultiIndex(levels=[['a', 'b', 'c'], [1, 2, 3, 4, 5]],
           labels=[[0, 0, 1, 1, 2], [0, 2, 4, 1, 3]])

In [156]:
print(aseries[0])
print(aseries[2])
print(aseries['b'][5])

0.300150284818
0.861730787993
0.861730787993

In [157]:
# converting to a data fram
aseries.unstack()

         1         2         3         4         5
a  0.30015       NaN -0.852024       NaN       NaN
b      NaN -1.119424       NaN       NaN  0.861731
c      NaN       NaN       NaN -1.105367       NaN

In [158]:
# Operations on levels of a data frame
# Example DF

df3 = pd.DataFrame(np.random.randn(4,3),index=[['a','a','b','b'],[1,1,2,2]],columns=[['alderman','clemons','brown'],['alpha','beta','beta']])
print(df3)
print(df3['alderman'])

     alderman   clemons     brown
        alpha      beta      beta
a 1  0.232670  0.308730  0.434225
  1  0.918247  0.347705 -0.957441
b 2 -1.246111 -0.363195 -1.848565
  2  1.984261 -0.385551  0.182916
        alpha
a 1  0.232670
  1  0.918247
b 2 -1.246111
  2  1.984261

In [159]:
# Swapping levels on the rows

print(df3.swaplevel(0,1))

     alderman   clemons     brown
        alpha      beta      beta
1 a  0.232670  0.308730  0.434225
  a  0.918247  0.347705 -0.957441
2 b -1.246111 -0.363195 -1.848565
  b  1.984261 -0.385551  0.182916

In [160]:
# Swapping levels on the columns

print(df3.swaplevel(0,1, axis = 1))

        alpha      beta
     alderman   clemons     brown
a 1  0.232670  0.308730  0.434225
  1  0.918247  0.347705 -0.957441
b 2 -1.246111 -0.363195 -1.848565
  2  1.984261 -0.385551  0.182916

In [161]:
# Selecting a level

print(df3.swaplevel(0,1, axis = 1)['beta'])

      clemons     brown
a 1  0.308730  0.434225
  1  0.347705 -0.957441
b 2 -0.363195 -1.848565
  2 -0.385551  0.182916

In [162]:
# statistics on levels
print(df3)
print(df3.sum(level=0))

     alderman   clemons     brown
        alpha      beta      beta
a 1  0.232670  0.308730  0.434225
  1  0.918247  0.347705 -0.957441
b 2 -1.246111 -0.363195 -1.848565
  2  1.984261 -0.385551  0.182916
   alderman   clemons     brown
      alpha      beta      beta
a  1.150917  0.656436 -0.523217
b  0.738150 -0.748746 -1.665648

In [166]:
print(df3.sum(level=1))

   alderman   clemons     brown
      alpha      beta      beta
1  1.150917  0.656436 -0.523217
2  0.738150 -0.748746 -1.665648

In [168]:
print(df3.sum(level=0,axis=1))

     alderman     brown   clemons
a 1  0.232670  0.434225  0.308730
  1  0.918247 -0.957441  0.347705
b 2 -1.246111 -1.848565 -0.363195
  2  1.984261  0.182916 -0.385551

## Descriptive Statistics

In [169]:
df1 = pd.DataFrame(np.random.randn(16).reshape(4,4), 
                   index = ['alpha', 'beta', 'gamma', 'delta'], 
                   columns = ['W', 'X', 'Y', 'Z'])

df1[df1< -.5] = np.nan


df1

              W         X         Y         Z
alpha  0.442267  0.489028       NaN       NaN
beta   1.717546       NaN       NaN  0.351711
gamma -0.037112 -0.097152       NaN       NaN
delta       NaN       NaN  0.716605  0.014017

In [170]:
# Row sums
# note that NA's are skipped unless it is the entire column

df1.sum()

W    2.122701
X    0.391876
Y    0.716605
Z    0.365728
dtype: float64

In [171]:
# Column sums not skipping NA's


df1.sum(axis = 1, skipna = False)

alpha   NaN
beta    NaN
gamma   NaN
delta   NaN
dtype: float64

In [172]:
# Remove the NA's

df1.fillna(0, inplace = True)
df1

              W         X         Y         Z
alpha  0.442267  0.489028  0.000000  0.000000
beta   1.717546  0.000000  0.000000  0.351711
gamma -0.037112 -0.097152  0.000000  0.000000
delta  0.000000  0.000000  0.716605  0.014017

In [173]:
# A very useful method is describe

df1.describe()

              W         X         Y         Z
count  4.000000  4.000000  4.000000  4.000000
mean   0.530675  0.097969  0.179151  0.091432
std    0.820665  0.264698  0.358302  0.173645
min   -0.037112 -0.097152  0.000000  0.000000
25%   -0.009278 -0.024288  0.000000  0.000000
50%    0.221133  0.000000  0.000000  0.007009
75%    0.761086  0.122257  0.179151  0.098441
max    1.717546  0.489028  0.716605  0.351711

In [174]:
a1 = np.array([[1,2],[3,4]])

a2 = np.array([[5,6],[7,8]])

d={1:a1[1] ,2:a2[1]}

DF = pd.DataFrame(d)

DF

   1  2
0  3  7
1  4  8

## Merging Data Frames

In [175]:
# Data frames for examples

df1 = pd.DataFrame({'key':['b','b','a','c','a','a','b'],'data1':range(7)})
df2 = pd.DataFrame({'key':['a','b','d','a'],'data2':range(4)})
print(df1)
print(df2)

   data1 key
0      0   b
1      1   b
2      2   a
3      3   c
4      4   a
5      5   a
6      6   b
   data2 key
0      0   a
1      1   b
2      2   d
3      3   a

In [176]:
# Simple merge
# What happens for matching indices? 
# What happens for different indices? 
# The default in merging on common key
# i.e., names in common (e.g., 'key')

pd.merge(df1,df2)

   data1 key  data2
0      0   b      1
1      1   b      1
2      6   b      1
3      2   a      0
4      2   a      3
5      4   a      0
6      4   a      3
7      5   a      0
8      5   a      3

In [177]:
# Example of merging on a key
# Here we specify the column for the join
# This is called an inner join (intersection)

pd.merge(df1,df2, on = "key")

   data1 key  data2
0      0   b      1
1      1   b      1
2      6   b      1
3      2   a      0
4      2   a      3
5      4   a      0
6      4   a      3
7      5   a      0
8      5   a      3

In [178]:
# An outer join
# Notice what happens at the union

pd.merge(df1,df2, how = 'outer')

    data1 key  data2
0     0.0   b    1.0
1     1.0   b    1.0
2     6.0   b    1.0
3     2.0   a    0.0
4     2.0   a    3.0
5     4.0   a    0.0
6     4.0   a    3.0
7     5.0   a    0.0
8     5.0   a    3.0
9     3.0   c    NaN
10    NaN   d    2.0

In [179]:
# Example merging with different keys,
# left and right
# inner join

df1 = pd.DataFrame({'key1':['b','b','a','c','a','a','b'],'data1':range(7)})
df2 = pd.DataFrame({'key2':['a','b','d','a'],'data2':range(4)})


pd.merge(df1,df2,left_on='key1',right_on= 'key2')

   data1 key1  data2 key2
0      0    b      1    b
1      1    b      1    b
2      6    b      1    b
3      2    a      0    a
4      2    a      3    a
5      4    a      0    a
6      4    a      3    a
7      5    a      0    a
8      5    a      3    a

In [180]:
# Union of the keys or outer join

pd.merge(df1,df2,how= 'outer')

MergeError: No common columns to perform merge on

In [181]:
# Merge with multiple keys

dfL = pd.DataFrame({'key1': ['a', 'b', 'a', 'c'],'key2': ['A', 'B', 'B', 'D'], 'DataL': np.arange(4) })
dfR = pd.DataFrame({'key1': ['a', 'a', 'e', 'b'],'key2': ['A', 'B', 'A', 'E'], 'DataL': np.arange(4)+10})

pd.merge(dfL, dfR, on = 'key1')

   DataL_x key1 key2_x  DataL_y key2_y
0        0    a      A       10      A
1        0    a      A       11      B
2        2    a      B       10      A
3        2    a      B       11      B
4        1    b      B       13      E

In [182]:
# Merge with suffix

pd.merge(dfL, dfR, on = 'key1', suffixes = ('_left', '_right'))

   DataL_left key1 key2_left  DataL_right key2_right
0           0    a         A           10          A
1           0    a         A           11          B
2           2    a         B           10          A
3           2    a         B           11          B
4           1    b         B           13          E

In [183]:
# More DF

df3 = pd.DataFrame([[1.,2.],[3.,4.],[5.,6.]],index=['a','c','e'],columns=['Ohio','Nevada'])
df4 = pd.DataFrame([[7.,8.],[9.,10.],[11.,12.],[13.,14.]],index=['b','c','d','e'],columns=['Missouri','Alabama'])
print(df3)
print(df4)

   Ohio  Nevada
a   1.0     2.0
c   3.0     4.0
e   5.0     6.0
   Missouri  Alabama
b       7.0      8.0
c       9.0     10.0
d      11.0     12.0
e      13.0     14.0

In [184]:
# join by index

df3.join(df4,how='outer')

   Ohio  Nevada  Missouri  Alabama
a   1.0     2.0       NaN      NaN
b   NaN     NaN       7.0      8.0
c   3.0     4.0       9.0     10.0
d   NaN     NaN      11.0     12.0
e   5.0     6.0      13.0     14.0

In [185]:
# join on a key only in one DF

print(df3.join(df4, on = 'Nevada'))

   Ohio  Nevada  Missouri  Alabama
a   1.0     2.0       NaN      NaN
c   3.0     4.0       NaN      NaN
e   5.0     6.0       NaN      NaN

In [186]:
# Concatinating data frames

print(pd.concat([df1,df2])) # rows
print(pd.concat([df1,df2], axis = 1)) # columns

   data1  data2 key1 key2
0    0.0    NaN    b  NaN
1    1.0    NaN    b  NaN
2    2.0    NaN    a  NaN
3    3.0    NaN    c  NaN
4    4.0    NaN    a  NaN
5    5.0    NaN    a  NaN
6    6.0    NaN    b  NaN
0    NaN    0.0  NaN    a
1    NaN    1.0  NaN    b
2    NaN    2.0  NaN    d
3    NaN    3.0  NaN    a
   data1 key1  data2 key2
0      0    b    0.0    a
1      1    b    1.0    b
2      2    a    2.0    d
3      3    c    3.0    a
4      4    a    NaN  NaN
5      5    a    NaN  NaN
6      6    b    NaN  NaN

## Homework

Repair the code for getting the stock data from Yahoo in Chapter 5 Section: Correlation and Covariance. Then run the examples in that section.

In [ ]:
import pandas.io.data as web

all_data = {}
for ticker in ['AAPL', 'IBM', 'MSFT', 'GOOG']:
    all_data[ticker] = web.get_data_yahoo(ticker)